tap "hashicorp/tap"

# Infrastructure and CLI tools
brew "awscli"
brew "hashicorp/tap/terraform"

# Core apps
cask "lulu"

# Ruby and language runtimes
brew "bdw-gc"
brew "ca-certificates"
brew "gdbm"
brew "glib"
brew "gmp"
brew "guile"
brew "icu4c"
brew "libffi"
brew "libpq"
brew "libyaml"
brew "mpdecimal"
brew "openssl@3"
brew "pcre"
brew "pcre2"
brew "python"
brew "readline"
brew "rbenv"
brew "ruby-build"
brew "shared-mime-info"
brew "sqlite"
brew "xz"
brew "zlib"
brew "zstd"

# Build toolchain and utilities
brew "bison"
brew "dnsmasq"
brew "gcc"
brew "isl"
brew "libmpc"
brew "lz4"
brew "m4"
brew "mpfr"
brew "p7zip"
brew "pkg-config"
brew "ripgrep"

# AI
cask "codex"
cask "lm-studio"
