tap "homebrew/bundle"
tap "homebrew/core"
tap "hashicorp/tap"

# Infrastructure and CLI tools
brew "awscli"
brew "hashicorp/tap/terraform"

# Core apps
cask "lulu"

# Language runtimes and build support
brew "bison"
brew "ca-certificates"
brew "dnsmasq"
brew "libffi"
brew "libpq"
brew "libyaml"
brew "lz4"
brew "openssl@3"
brew "p7zip"
brew "pcre"
brew "pkg-config"
brew "python"
brew "readline"
brew "rbenv"
brew "ruby-build"
brew "zlib"
brew "zstd"
